% Task 2: Relational Data

% Часть 2
% Данные four.pl
% Вариант 2

group(102,['Петров','Ивановский','Биткоинов','Шарпин','Эксель','Текстописов','Криптовалютников','Азурин','Круглотличников']).
group(101,['Петровский','Сидоров','Мышин','Безумников','Густобуквенникова']).
group(104,['Иванов','Запорожцев','Джаво','Фулл','Круглосчиталкин','Блокчейнис']).
group(103,['Сидоркин','Эфиркина','Сиплюсплюсов','Программиро','Клавиатурникова','Решетников','Текстописова','Вебсервисов']).

subject('Логическое программирование',[grade('Петров',4),grade('Петровский',2),grade('Иванов',5),grade('Ивановский',5),grade('Запорожцев',5),grade('Сидоров',2),grade('Сидоркин',4),grade('Биткоинов',4),grade('Эфиркина',3),grade('Сиплюсплюсов',4),grade('Программиро',4),grade('Джаво',2),grade('Клавиатурникова',5),grade('Мышин',3),grade('Фулл',5),grade('Безумников',5),grade('Шарпин',5),grade('Круглосчиталкин',4),grade('Решетников',5),grade('Эксель',4),grade('Текстописов',4),grade('Текстописова',5),grade('Густобуквенникова',5),grade('Криптовалютников',5),grade('Блокчейнис',3),grade('Азурин',5),grade('Вебсервисов',5),grade('Круглотличников',3)]).
subject('Математический анализ',[grade('Петров',2),grade('Петровский',4),grade('Иванов',4),grade('Ивановский',4),grade('Запорожцев',4),grade('Сидоров',5),grade('Сидоркин',4),grade('Биткоинов',5),grade('Эфиркина',4),grade('Сиплюсплюсов',5),grade('Программиро',3),grade('Джаво',4),grade('Клавиатурникова',3),grade('Мышин',5),grade('Фулл',4),grade('Безумников',3),grade('Шарпин',4),grade('Круглосчиталкин',4),grade('Решетников',5),grade('Эксель',3),grade('Текстописов',4),grade('Текстописова',4),grade('Густобуквенникова',5),grade('Криптовалютников',4),grade('Блокчейнис',3),grade('Азурин',5),grade('Вебсервисов',4),grade('Круглотличников',5)]).
subject('Функциональное программирование',[grade('Петров',3),grade('Петровский',5),grade('Иванов',4),grade('Ивановский',3),grade('Запорожцев',3),grade('Сидоров',3),grade('Сидоркин',4),grade('Биткоинов',5),grade('Эфиркина',5),grade('Сиплюсплюсов',5),grade('Программиро',4),grade('Джаво',5),grade('Клавиатурникова',5),grade('Мышин',5),grade('Фулл',4),grade('Безумников',5),grade('Шарпин',3),grade('Круглосчиталкин',3),grade('Решетников',4),grade('Эксель',4),grade('Текстописов',3),grade('Текстописова',4),grade('Густобуквенникова',4),grade('Криптовалютников',5),grade('Блокчейнис',5),grade('Азурин',4),grade('Вебсервисов',4),grade('Круглотличников',4)]).
subject('Информатика',[grade('Петров',4),grade('Петровский',3),grade('Иванов',3),grade('Ивановский',4),grade('Запорожцев',3),grade('Сидоров',4),grade('Сидоркин',4),grade('Биткоинов',4),grade('Эфиркина',3),grade('Сиплюсплюсов',2),grade('Программиро',4),grade('Джаво',5),grade('Клавиатурникова',4),grade('Мышин',5),grade('Фулл',3),grade('Безумников',4),grade('Шарпин',5),grade('Круглосчиталкин',5),grade('Решетников',4),grade('Эксель',4),grade('Текстописов',3),grade('Текстописова',5),grade('Густобуквенникова',3),grade('Криптовалютников',2),grade('Блокчейнис',4),grade('Азурин',5),grade('Вебсервисов',4),grade('Круглотличников',4)]).
subject('Английский язык',[grade('Петров',4),grade('Петровский',5),grade('Иванов',3),grade('Ивановский',4),grade('Запорожцев',4),grade('Сидоров',5),grade('Сидоркин',3),grade('Биткоинов',5),grade('Эфиркина',5),grade('Сиплюсплюсов',5),grade('Программиро',4),grade('Джаво',4),grade('Клавиатурникова',3),grade('Мышин',5),grade('Фулл',4),grade('Безумников',3),grade('Шарпин',4),grade('Круглосчиталкин',4),grade('Решетников',2),grade('Эксель',4),grade('Текстописов',4),grade('Текстописова',5),grade('Густобуквенникова',5),grade('Криптовалютников',5),grade('Блокчейнис',3),grade('Азурин',2),grade('Вебсервисов',4),grade('Круглотличников',4)]).
subject('Психология',[grade('Петров',5),grade('Петровский',3),grade('Иванов',3),grade('Ивановский',3),grade('Запорожцев',5),grade('Сидоров',3),grade('Сидоркин',5),grade('Биткоинов',4),grade('Эфиркина',5),grade('Сиплюсплюсов',5),grade('Программиро',3),grade('Джаво',4),grade('Клавиатурникова',4),grade('Мышин',4),grade('Фулл',4),grade('Безумников',2),grade('Шарпин',3),grade('Круглосчиталкин',2),grade('Решетников',4),grade('Эксель',3),grade('Текстописов',3),grade('Текстописова',5),grade('Густобуквенникова',4),grade('Криптовалютников',5),grade('Блокчейнис',5),grade('Азурин',3),grade('Вебсервисов',5),grade('Круглотличников',4)]).

% 1)Напечатать средний балл для каждого предмета

% Сумма оценок по предмету
% (список оценок, сумма оценок)
sum_grades([],0).
sum_grades([grade(X,Y)|T],N):- sum_grades(T,M), N is Y + M.

% Средний балл для предмета
% (название предмета, средняя оценка)
average_mark(Sub,Mark):-
    subject(Sub,Y),
    sum_grades(Y, Sum),
    length(Y, Len),
    Mark is Sum / Len.


% 2)Для каждой группы, найти количество не сдавших студентов

% Список всех оценок по всем предметам
% (список предметов, список оценок)
all_marks([],L).
all_marks([H|T], List_pass):-subject(H,X), all_marks(T, New_list), append(X, New_list, List_pass).

% Удаление повторяющихся оценок, чтобы если в списке один и тот же студент получил больше одной 2 по разным предметам, он посчитался лишь один разным
delete_all(_,[],[]).
delete_all(X,[X|L],L1):-delete_all(X,L,L1).
delete_all(X,[Y|L],[Y|L1]):- X \= Y, delete_all(X,L,L1).

remove_same([],[]).
remove_same([H|T],[H|T1]):-delete_all(H,T,T2), remove_same(T2,T1).

% Проверяем, сколько студентов, получивших 2, имеются в нужной группе
% (список всех оценок, список группы, количество несдавших студентов из группы)
check([],L,0).
check([grade(X,Y)|T],L,N):- Y < 3, my_member(X, L), !, check(T,L,M), N is M + 1.
check([_|T],L,N):-check(T,L,N).

% Количество несдавших студентов в группе
% (номер группы, число несдавших)
do_not_pass_group(Gr,Count):-
    group(Gr, Lgroup),
    findall(Sub, subject(Sub,_), Subs),
    all_marks(Subs, List_pass),
    remove_same(List_pass, New),
    check(New, Lgroup, Count).


% 3)Найти количество несдавших студентов для каждого из предметов
%(список оценок, число несдавших)
count_do_not_pass([],0).
count_do_not_pass([grade(X,Y)|T],N):- Y < 3, !, count_do_not_pass(T,M), N is M + 1.
count_do_not_pass([_|T],N):-count_do_not_pass(T,N).

% (название предмета, число студентов)
do_not_pass_sub(Sub,Count):-
    subject(Sub,Y),
    count_do_not_pass(Y,Count).
